Autodesk.Revit.UI.PulldownButton.AddSeparator
Adds a separator to the drop-down list.
Remarks: The separator will appear just below the last added PushButton.

Autodesk.Revit.UI.PulldownButton.AddPushButton(Autodesk.Revit.UI.PushButtonData)
Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.
buttonData: An object containing the data needed to construct the pushbutton.
Remarks:  The new button will display its large image if PushButton.LargeImage is set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when buttonData is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when button with buttonData.Name already exists in the button.
Returns:  The newly added pushbutton.

Autodesk.Revit.UI.PulldownButton.GetItems
Gets a copy of the collection of buttons assigned to the pulldown button.

Autodesk.Revit.UI.PulldownButton
The PulldownButton object represents a button with a drop-down list on RibbonPanel.
Remarks: Use of this class is not supported in Revit Macros.